tutorials/incompressible/icoDyMFoam/mixer2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    impellerWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    baffleWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    insideSlider
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    outsideSlider
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
